ranjithaguna/pv/LED_Demo/source/pic32cx/component/dma_chan01.h
/**
 * \brief Component description for PIC32CX/0525SG12 DMA_CHAN01
 *
 * Copyright (c) 2018 Microchip Technology Inc.
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 */

/* file generated from device description version 2018-04-24T21:15:30Z */
#ifndef _PIC32CX_0525SG12_DMA_CHAN01_COMPONENT_H_
#define _PIC32CX_0525SG12_DMA_CHAN01_COMPONENT_H_

/** \addtogroup PIC32CX_0525SG12_DMA_CHAN01 DMA Channel 01 Registers
 *  @{
 */
/* ========================================================================== */
/**  SOFTWARE API DEFINITION FOR DMA_CHAN01 */
/* ========================================================================== */

/* -------- DMA_CHAN01_DMA_CHANNEL_ACTIVATE : (DMA_CHAN01 Offset: 0x00) (R/W 8) Enable this channel for operation. The DMA Main Control: Activate must also be enabled for this channel to be operational. -------- */

typedef union
{
  struct
  {
    uint8_t  CHANNEL_ACTIVATE:1;        /**< bit:      0  Enable this channel for operation. The DMA Main Control:Activate must also be enabled for this channel to be operational.\n                  1=Enable channel(block). Each individual channel must be enabled separately.\n                  0=Disable channel(block). */
    uint8_t  :7;                        /**< bit:   1..7  Reserved                                      */
  };
  uint8_t  w;
} __DMA_CHAN01_DMA_CHANNEL_ACTIVATE_bits_t;
#define DMA_CHAN01_DMA_CHANNEL_ACTIVATE_RESETVALUE (0x00U)                                       /**<  (DMA_CHAN01_DMA_CHANNEL_ACTIVATE) Enable this channel for operation. The DMA Main Control: Activate must also be enabled for this channel to be operational.  Reset Value */

#define DMA_CHAN01_DMA_CHANNEL_ACTIVATE_CHANNEL_ACTIVATE_Pos (0)                                            /**< (DMA_CHAN01_DMA_CHANNEL_ACTIVATE) Enable this channel for operation. The DMA Main Control:Activate must also be enabled for this channel to be operational.\n                  1=Enable channel(block). Each individual channel must be enabled separately.\n                  0=Disable channel(block). Position */
#define DMA_CHAN01_DMA_CHANNEL_ACTIVATE_CHANNEL_ACTIVATE_Msk (0x1U << DMA_CHAN01_DMA_CHANNEL_ACTIVATE_CHANNEL_ACTIVATE_Pos)  /**< (DMA_CHAN01_DMA_CHANNEL_ACTIVATE) Enable this channel for operation. The DMA Main Control:Activate must also be enabled for this channel to be operational.\n                  1=Enable channel(block). Each individual channel must be enabled separately.\n                  0=Disable channel(block). Mask */
#define DMA_CHAN01_DMA_CHANNEL_ACTIVATE_Msk   (0x00000001UL)                                 /**< (DMA_CHAN01_DMA_CHANNEL_ACTIVATE) Register Mask  */

/* -------- DMA_CHAN01_MEMORY_START_ADDRESS : (DMA_CHAN01 Offset: 0x04) (R/W 32) This is the starting address for the Memory device. -------- */

typedef union
{
  uint32_t w;
} __DMA_CHAN01_MEMORY_START_ADDRESS_bits_t;
#define DMA_CHAN01_MEMORY_START_ADDRESS_RESETVALUE (0x00U)                                       /**<  (DMA_CHAN01_MEMORY_START_ADDRESS) This is the starting address for the Memory device.  Reset Value */

#define DMA_CHAN01_MEMORY_START_ADDRESS_Msk   (0x00000000UL)                                 /**< (DMA_CHAN01_MEMORY_START_ADDRESS) Register Mask  */

/* -------- DMA_CHAN01_MEMORY_END_ADDRESS : (DMA_CHAN01 Offset: 0x08) (R/W 32) This is the ending address for the Memory device. -------- */

typedef union
{
  uint32_t w;
} __DMA_CHAN01_MEMORY_END_ADDRESS_bits_t;
#define DMA_CHAN01_MEMORY_END_ADDRESS_RESETVALUE (0x00U)                                       /**<  (DMA_CHAN01_MEMORY_END_ADDRESS) This is the ending address for the Memory device.  Reset Value */

#define DMA_CHAN01_MEMORY_END_ADDRESS_Msk     (0x00000000UL)                                 /**< (DMA_CHAN01_MEMORY_END_ADDRESS) Register Mask  */

/* -------- DMA_CHAN01_DEVICE_ADDRESS : (DMA_CHAN01 Offset: 0x0c) (R/W 32) This is the Master Device address. -------- */

typedef union
{
  uint32_t w;
} __DMA_CHAN01_DEVICE_ADDRESS_bits_t;
#define DMA_CHAN01_DEVICE_ADDRESS_RESETVALUE (0x00U)                                       /**<  (DMA_CHAN01_DEVICE_ADDRESS) This is the Master Device address.  Reset Value */

#define DMA_CHAN01_DEVICE_ADDRESS_Msk         (0x00000000UL)                                 /**< (DMA_CHAN01_DEVICE_ADDRESS) Register Mask  */

/* -------- DMA_CHAN01_CONTROL : (DMA_CHAN01 Offset: 0x10) (R/W 32) DMA Channel N Control -------- */

typedef union
{
  struct
  {
    uint32_t RUN:1;                     /**< bit:      0  This is a control field. Note: This bit only applies to Hardware Flow Control mode.\n                  1= This channel is enabled and will service transfer requests\n                  0=This channel is disabled. All transfer requests are ignored. */
    uint32_t REQUEST:1;                 /**< bit:      1  This is a status field.\n                  1= There is a transfer request from the Master Device\n                  0= There is no transfer request from the Master Device */
    uint32_t DONE:1;                    /**< bit:      2  This is a status signal. It is only valid while DMA Channel Control: Run is Enabled. \n                  This is the inverse of the DMA Channel Control: Busy field, except this is qualified with the DMA Channel Control:Run field.\n                  1=Channel is done\n                  0=Channel is not done or it is OFF */
    uint32_t STATUS:2;                  /**< bit:   3..4  This is a status signal. The status decode is listed in priority order with the highest priority first.\n                  3: Error detected by the DMA\n                  2: The DMA Channel is externally done, in that the Device has terminated the transfer over the Hardware Flow Control through the Port dma_term\n                  1: The DMA Channel is locally done, in that Memory Start Address equals Memory End Address\n                  0: DMA Channel Control:Run is Disabled (0x0) */
    uint32_t BUSY:1;                    /**< bit:      5  This is a status signal.\n                  1=The DMA Channel is busy (FSM is not IDLE)\n                  0=The DMA Channel is not busy (FSM is IDLE) */
    uint32_t :2;                        /**< bit:   6..7  Reserved                                      */
    uint32_t TX_DIRECTION:1;            /**< bit:      8  This determines the direction of the DMA Transfer.\n                  1=Data Packet Read from Memory Start Address followed by Data Packet Write to Device Address\n                  0=Data Packet Read from Device Address followed by Data Packet Write to Memory Start Address */
    uint32_t HARDWARE_FLOW_CONTROL_DEVICE:7;  /**< bit:  9..15  This is the device that is connected to this channel as its Hardware Flow Control master.\n                  The Flow Control Interface is a bus with each master concatenated onto it.\n                  This selects which bus index of the concatenated Flow Control Interface bus is targeted towards this channel.\n                  The Flow Control Interface Port list is dma_req, dma_term, and dma_done. */
    uint32_t INCREMENT_MEM_ADDR:1;      /**< bit:     16  This will enable an auto-increment to the DMA Channel Memory Address.\n                  1=Increment the DMA Channel Memory Address by DMA Channel Control:Transfer Size after every Data Packet transfer\n                  0=Do nothing */
    uint32_t INCREMENT_DEVICE_ADDR:1;   /**< bit:     17  This will enable an auto-increment to the DMA Channel Device Address.\n                  1: Increment the DMA Channel Device Address by DMA Channel Control:Transfer Size after every Data Packet transfer\n                  0: Do nothing */
    uint32_t LOCK:1;                    /**< bit:     18  This is used to lock the arbitration of the Channel Arbiter on this channel once this channel is granted. Once this is locked, it will remain on the arbiter until it has completed it transfer (either the Transfer Aborted, Transfer Done or Transfer Terminated conditions). */
    uint32_t DISABLE_HW_FLOW_CONTROL:1;  /**< bit:     19  This will Disable the Hardware Flow Control. When disabled, any DMA Master device attempting to communicate to the DMA over the DMA Flow Control Interface (Ports: dma_req, dma_term, and dma_done) will be ignored. This should be set before using the DMA channel in Firmware Flow Control mode. */
    uint32_t TRANSFER_SIZE:3;           /**< bit: 20..22  This is the transfer size in Bytes of each Data Packet transfer.\n                  Note: The transfer size must be a legal AMBA transfer size. Valid sizes are 1, 2 and 4 Bytes. */
    uint32_t :1;                        /**< bit:     23  Reserved                                      */
    uint32_t TRANSFER_GO:1;             /**< bit:     24  This is used for the Firmware Flow Control DMA transfer. */
    uint32_t TRANSFER_ABORT:1;          /**< bit:     25  This is used to abort the current transfer on this DMA Channel. The aborted transfer will be forced to terminate immediately. */
    uint32_t :6;                        /**< bit: 26..31  Reserved                                      */
  };
  uint32_t w;
} __DMA_CHAN01_CONTROL_bits_t;
