ranjithaguna/pv/LED_Demo/source/pic32cx/component/dma_chan01.h
/* -------- DMA_CHAN01_INT_EN : (DMA_CHAN01 Offset: 0x18) (R/W 8) DMA CHANNEL N INTERRUPT ENABLE -------- */

typedef union
{
  struct
  {
    uint8_t  STATUS_ENABLE_BUS_ERROR:1;  /**< bit:      0  This is an interrupt enable for DMA Channel Interrupt:Status Bus Error.\n                  1=Enable Interrupt\n                  0=Disable Interrupt */
    uint8_t  STATUS_ENABLE_FLOW_CONTROL:1;  /**< bit:      1  This is an interrupt enable for DMA Channel Interrupt:Status Flow Control Error.\n                  1=Enable Interrupt\n                  0=Disable Interrupt */
    uint8_t  STATUS_ENABLE_DONE:1;      /**< bit:      2  This is an interrupt enable for DMA Channel Interrupt:Status Done.\n                  1=Enable Interrupt\n                  0=Disable Interrupt */
    uint8_t  :5;                        /**< bit:   3..7  Reserved                                      */
  };
  uint8_t  w;
} __DMA_CHAN01_INT_EN_bits_t;
#define DMA_CHAN01_INT_EN_RESETVALUE        (0x00U)                                       /**<  (DMA_CHAN01_INT_EN) DMA CHANNEL N INTERRUPT ENABLE  Reset Value */

#define DMA_CHAN01_INT_EN_STATUS_ENABLE_BUS_ERROR_Pos (0)                                            /**< (DMA_CHAN01_INT_EN) This is an interrupt enable for DMA Channel Interrupt:Status Bus Error.\n                  1=Enable Interrupt\n                  0=Disable Interrupt Position */
#define DMA_CHAN01_INT_EN_STATUS_ENABLE_BUS_ERROR_Msk (0x1U << DMA_CHAN01_INT_EN_STATUS_ENABLE_BUS_ERROR_Pos)  /**< (DMA_CHAN01_INT_EN) This is an interrupt enable for DMA Channel Interrupt:Status Bus Error.\n                  1=Enable Interrupt\n                  0=Disable Interrupt Mask */
#define DMA_CHAN01_INT_EN_STATUS_ENABLE_FLOW_CONTROL_Pos (1)                                            /**< (DMA_CHAN01_INT_EN) This is an interrupt enable for DMA Channel Interrupt:Status Flow Control Error.\n                  1=Enable Interrupt\n                  0=Disable Interrupt Position */
#define DMA_CHAN01_INT_EN_STATUS_ENABLE_FLOW_CONTROL_Msk (0x1U << DMA_CHAN01_INT_EN_STATUS_ENABLE_FLOW_CONTROL_Pos)  /**< (DMA_CHAN01_INT_EN) This is an interrupt enable for DMA Channel Interrupt:Status Flow Control Error.\n                  1=Enable Interrupt\n                  0=Disable Interrupt Mask */
#define DMA_CHAN01_INT_EN_STATUS_ENABLE_DONE_Pos (2)                                            /**< (DMA_CHAN01_INT_EN) This is an interrupt enable for DMA Channel Interrupt:Status Done.\n                  1=Enable Interrupt\n                  0=Disable Interrupt Position */
#define DMA_CHAN01_INT_EN_STATUS_ENABLE_DONE_Msk (0x1U << DMA_CHAN01_INT_EN_STATUS_ENABLE_DONE_Pos)  /**< (DMA_CHAN01_INT_EN) This is an interrupt enable for DMA Channel Interrupt:Status Done.\n                  1=Enable Interrupt\n                  0=Disable Interrupt Mask */
#define DMA_CHAN01_INT_EN_Msk                 (0x00000007UL)                                 /**< (DMA_CHAN01_INT_EN) Register Mask  */

/* -------- DMA_CHAN01_FILL_ENABLE : (DMA_CHAN01 Offset: 0x20) (R/W 32) DMA CHANNEL N FILL ENABLE -------- */

typedef union
{
  struct
  {
    uint32_t FILL_MODE_ENABLE:1;        /**< bit:      0  1=Enable the calculation of CRC-32 for DMA Channel N\n     0=Disable the calculation of CRC-32 for DMA Channel N */
    uint32_t :31;                       /**< bit:  1..31  Reserved                                      */
  };
  uint32_t w;
} __DMA_CHAN01_FILL_ENABLE_bits_t;
#define DMA_CHAN01_FILL_ENABLE_RESETVALUE   (0x00U)                                       /**<  (DMA_CHAN01_FILL_ENABLE) DMA CHANNEL N FILL ENABLE  Reset Value */

#define DMA_CHAN01_FILL_ENABLE_FILL_MODE_ENABLE_Pos (0)                                            /**< (DMA_CHAN01_FILL_ENABLE) 1=Enable the calculation of CRC-32 for DMA Channel N\n     0=Disable the calculation of CRC-32 for DMA Channel N Position */
#define DMA_CHAN01_FILL_ENABLE_FILL_MODE_ENABLE_Msk (0x1U << DMA_CHAN01_FILL_ENABLE_FILL_MODE_ENABLE_Pos)  /**< (DMA_CHAN01_FILL_ENABLE) 1=Enable the calculation of CRC-32 for DMA Channel N\n     0=Disable the calculation of CRC-32 for DMA Channel N Mask */
#define DMA_CHAN01_FILL_ENABLE_Msk            (0x00000001UL)                                 /**< (DMA_CHAN01_FILL_ENABLE) Register Mask  */

/* -------- DMA_CHAN01_FILL_DATA : (DMA_CHAN01 Offset: 0x24) (R/W 32) DMA CHANNEL N FILL DATA -------- */

typedef union
{
  struct
  {
    uint32_t FILL_DATA:32;              /**< bit:  0..31  This is the data pattern used to fill memory. */
  };
  uint32_t w;
} __DMA_CHAN01_FILL_DATA_bits_t;
#define DMA_CHAN01_FILL_DATA_RESETVALUE     (0x00U)                                       /**<  (DMA_CHAN01_FILL_DATA) DMA CHANNEL N FILL DATA  Reset Value */

#define DMA_CHAN01_FILL_DATA_FILL_DATA_Pos    (0)                                            /**< (DMA_CHAN01_FILL_DATA) This is the data pattern used to fill memory. Position */
#define DMA_CHAN01_FILL_DATA_FILL_DATA_Msk    (0xFFFFFFFFU << DMA_CHAN01_FILL_DATA_FILL_DATA_Pos)  /**< (DMA_CHAN01_FILL_DATA) This is the data pattern used to fill memory. Mask */
#define DMA_CHAN01_FILL_DATA_FILL_DATA(value) (DMA_CHAN01_FILL_DATA_FILL_DATA_Msk & ((value) << DMA_CHAN01_FILL_DATA_FILL_DATA_Pos))
#define DMA_CHAN01_FILL_DATA_Msk              (0xFFFFFFFFUL)                                 /**< (DMA_CHAN01_FILL_DATA) Register Mask  */

/* -------- DMA_CHAN01_FILL_STATUS : (DMA_CHAN01 Offset: 0x28) (R/W 32) DMA CHANNEL N FILL STATUS -------- */

typedef union
{
  struct
  {
    uint32_t FILL_DONE:1;               /**< bit:      0  This bit is set to '1b' when the CRC calculation has completed from either normal or forced termination.\n     It is cleared to '0b' when the DMA controller starts a new transfer on the channel. */
    uint32_t FILL_RUNNING:1;            /**< bit:      1  This bit is set to '1b' when the DMA controller starts the post-transfer transmission of the CRC.\n     It is only set when the post-transfer is enabled by the CRC_POST_TRANSFER_ENABLE field. This bit is cleared\n     to '0b' when the post-transfer completes. */
    uint32_t :30;                       /**< bit:  2..31  Reserved                                      */
  };
  uint32_t w;
} __DMA_CHAN01_FILL_STATUS_bits_t;
#define DMA_CHAN01_FILL_STATUS_RESETVALUE   (0x00U)                                       /**<  (DMA_CHAN01_FILL_STATUS) DMA CHANNEL N FILL STATUS  Reset Value */

#define DMA_CHAN01_FILL_STATUS_FILL_DONE_Pos  (0)                                            /**< (DMA_CHAN01_FILL_STATUS) This bit is set to '1b' when the CRC calculation has completed from either normal or forced termination.\n     It is cleared to '0b' when the DMA controller starts a new transfer on the channel. Position */
#define DMA_CHAN01_FILL_STATUS_FILL_DONE_Msk  (0x1U << DMA_CHAN01_FILL_STATUS_FILL_DONE_Pos)  /**< (DMA_CHAN01_FILL_STATUS) This bit is set to '1b' when the CRC calculation has completed from either normal or forced termination.\n     It is cleared to '0b' when the DMA controller starts a new transfer on the channel. Mask */
#define DMA_CHAN01_FILL_STATUS_FILL_RUNNING_Pos (1)                                            /**< (DMA_CHAN01_FILL_STATUS) This bit is set to '1b' when the DMA controller starts the post-transfer transmission of the CRC.\n     It is only set when the post-transfer is enabled by the CRC_POST_TRANSFER_ENABLE field. This bit is cleared\n     to '0b' when the post-transfer completes. Position */
#define DMA_CHAN01_FILL_STATUS_FILL_RUNNING_Msk (0x1U << DMA_CHAN01_FILL_STATUS_FILL_RUNNING_Pos)  /**< (DMA_CHAN01_FILL_STATUS) This bit is set to '1b' when the DMA controller starts the post-transfer transmission of the CRC.\n     It is only set when the post-transfer is enabled by the CRC_POST_TRANSFER_ENABLE field. This bit is cleared\n     to '0b' when the post-transfer completes. Mask */
#define DMA_CHAN01_FILL_STATUS_Msk            (0x00000003UL)                                 /**< (DMA_CHAN01_FILL_STATUS) Register Mask  */

/** \brief DMA_CHAN01 register offsets definitions */
#define DMA_CHAN01_DMA_CHANNEL_ACTIVATE_OFFSET (0x00)         /**< (DMA_CHAN01_DMA_CHANNEL_ACTIVATE) Enable this channel for operation. The DMA Main Control: Activate must also be enabled for this channel to be operational. Offset */
#define DMA_CHAN01_MEMORY_START_ADDRESS_OFFSET (0x04)         /**< (DMA_CHAN01_MEMORY_START_ADDRESS) This is the starting address for the Memory device. Offset */
#define DMA_CHAN01_MEMORY_END_ADDRESS_OFFSET (0x08)         /**< (DMA_CHAN01_MEMORY_END_ADDRESS) This is the ending address for the Memory device. Offset */
#define DMA_CHAN01_DEVICE_ADDRESS_OFFSET (0x0C)         /**< (DMA_CHAN01_DEVICE_ADDRESS) This is the Master Device address. Offset */
#define DMA_CHAN01_CONTROL_OFFSET    (0x10)         /**< (DMA_CHAN01_CONTROL) DMA Channel N Control Offset */
#define DMA_CHAN01_INT_STATUS_OFFSET (0x14)         /**< (DMA_CHAN01_INT_STATUS) DMA Channel N Interrupt Status Offset */
#define DMA_CHAN01_INT_EN_OFFSET     (0x18)         /**< (DMA_CHAN01_INT_EN) DMA CHANNEL N INTERRUPT ENABLE Offset */
#define DMA_CHAN01_FILL_ENABLE_OFFSET (0x20)         /**< (DMA_CHAN01_FILL_ENABLE) DMA CHANNEL N FILL ENABLE Offset */
#define DMA_CHAN01_FILL_DATA_OFFSET  (0x24)         /**< (DMA_CHAN01_FILL_DATA) DMA CHANNEL N FILL DATA Offset */
#define DMA_CHAN01_FILL_STATUS_OFFSET (0x28)         /**< (DMA_CHAN01_FILL_STATUS) DMA CHANNEL N FILL STATUS Offset */

/** \brief DMA_CHAN01 register API structure */
typedef struct
{  /* DMA Channel 01 Registers */
  __IO  __DMA_CHAN01_DMA_CHANNEL_ACTIVATE_bits_t DMA_CHANNEL_ACTIVATE; /**< Offset: 0x00 (R/W   8) Enable this channel for operation. The DMA Main Control: Activate must also be enabled for this channel to be operational. */
  __IO  __DMA_CHAN01_MEMORY_START_ADDRESS_bits_t MEMORY_START_ADDRESS; /**< Offset: 0x04 (R/W  32) This is the starting address for the Memory device. */
  __IO  __DMA_CHAN01_MEMORY_END_ADDRESS_bits_t MEMORY_END_ADDRESS; /**< Offset: 0x08 (R/W  32) This is the ending address for the Memory device. */
  __IO  __DMA_CHAN01_DEVICE_ADDRESS_bits_t DEVICE_ADDRESS; /**< Offset: 0x0C (R/W  32) This is the Master Device address. */
  __IO  __DMA_CHAN01_CONTROL_bits_t    CONTROL;       /**< Offset: 0x10 (R/W  32) DMA Channel N Control */
  __IO  __DMA_CHAN01_INT_STATUS_bits_t INT_STATUS;    /**< Offset: 0x14 (R/W   8) DMA Channel N Interrupt Status */
  __IO  __DMA_CHAN01_INT_EN_bits_t     INT_EN;        /**< Offset: 0x18 (R/W   8) DMA CHANNEL N INTERRUPT ENABLE */
  __IO  __DMA_CHAN01_FILL_ENABLE_bits_t FILL_ENABLE;   /**< Offset: 0x20 (R/W  32) DMA CHANNEL N FILL ENABLE */
  __IO  __DMA_CHAN01_FILL_DATA_bits_t  FILL_DATA;     /**< Offset: 0x24 (R/W  32) DMA CHANNEL N FILL DATA */
  __IO  __DMA_CHAN01_FILL_STATUS_bits_t FILL_STATUS;   /**< Offset: 0x28 (R/W  32) DMA CHANNEL N FILL STATUS */
} dmachan01_registers_t;
/** @}  end of DMA Channel 01 Registers */

#endif /* _PIC32CX_0525SG12_DMA_CHAN01_COMPONENT_H_ */
